const data = {
  "_id": 2564,
  "หน่วยกิต": 134,
  "หมวด": {
    "วิชาศึกษาทั่วไป": {
      "หน่วยกิต": 30,
      "วิชาบังคับ": {
        "หน่วยกิต": 24,
        "กลุ่มวิชาด้านการพัฒนาทักษะการเป็นผู้เรียนรู้": [
          {
            "รหัสวิชา": "001101",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "001102",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "001201",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "001225",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "204100",
            "หน่วยกิต": 3
          }
        ],
        "กลุ่มวิชาด้านการพัฒนาทักษะการเป็นผู้ร่วมสร้างสรรค์นวัตกรรม": [
          {
            "รหัสวิชา": "201190",
            "หน่วยกิต": 3
          }
        ],
        "กลุ่มวิชาด้านการพัฒนาทักษะการเป็นพลเมืองที่เข้มแข็ง": [
          {
            "รหัสวิชา": "140401",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "201111",
            "หน่วยกิต": 3
          }
        ]
      },
      "GE_Elective": {
        "หน่วยกิต": 6,
        "กลุ่มวิชาด้านการพัฒนาทักษะการเป็นผู้เรียนรู้": [
          {
            "รหัสวิชา": "050100",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "074100",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "701181",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "702101",
            "หน่วยกิต": 3
          }
        ],
        "กลุ่มวิชาด้านการพัฒนาทักษะการเป็นผู้ร่วมสร้างสรรค์นวัตกรรม": [
          {
            "รหัสวิชา": "013110",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "176100",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "201114",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "703103",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "751100",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "851103",
            "หน่วยกิต": 3
          }
        ],
        "กลุ่มวิชาด้านการพัฒนาทักษะการเป็นพลเมืองที่เข้มแข็ง": [
          {
            "รหัสวิชา": "801100",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "951100",
            "หน่วยกิต": 3
          }
        ]
      }
    },
    "วิชาเฉพาะ": {
      "หน่วยกิต": 99,
      "วิชาแกน": {
        "หน่วยกิต": 24,
        "รายวิชา": [
          {
            "รหัสวิชา": "202101",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "203103",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "204111",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "206111",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "206112",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "206183",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "207187",
            "หน่วยกิต": 3
          },
          {
            "รหัสวิชา": "208269",
            "หน่วยกิต": 3
          }
        ]
      },
      "วิชาเอก": {
        "หน่วยกิต": 59,
        "วิชาเอกบังคับร่วม": {
          "หน่วยกิต": 41,
          "รายวิชา": [
            {
              "รหัสวิชา": "204203",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204306",
              "หน่วยกิต": 1
            },
            {
              "รหัสวิชา": "204212",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204271",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204321",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204361",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204451",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204390",
              "หน่วยกิต": 1
            },
            {
              "รหัสวิชา": "204490",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204114",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204232",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204252",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204315",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204341",
              "หน่วยกิต": 3
            },
            {
              "รหัสวิชา": "204231",
              "หน่วยกิต": 3
            }
          ]
        },
        "วิชาเอกบังคับประจำแผน": {
          "แผนปกติ": {
            "หน่วยกิต": 3,
            "รายวิชา": [
              {
                "รหัสวิชา": "204491",
                "หน่วยกิต": 3
              },
              {
                "รหัสวิชา": "204499",
                "หน่วยกิต": 3
              }
            ]
          },
          "แผนสหกิจศึกษา": {
            "หน่วยกิต": 7,
            "รายวิชา": [
              {
                "รหัสวิชา": "204496",
                "หน่วยกิต": 3
              },
              {
                "รหัสวิชา": "204497",
                "หน่วยกิต": 1
              }
            ]
          },
          "แผนก้าวหน้า": {
            "หน่วยกิต": 3,
            "รายวิชา": [
              {
                "รหัสวิชา": "204491",
                "หน่วยกิต": 1
              },
              {
                "รหัสวิชา": "204499",
                "หน่วยกิต": 2
              }
            ]
          }
        },
        "วิชาเอกเลือก": {
          "แผนปกติ": {
            "หน่วยกิต": 15,
            "เงื่อนไข": {
              "400": 9
            }
          },
          "แผนสหกิจศึกษา": {
            "หน่วยกิต": 12,
            "เงื่อนไข": {
              "400": 6
            }
          },
          "แผนก้าวหน้า": {
            "หน่วยกิต": 27,
            "เงื่อนไข": {
              "300": 9,
              "400": 12
            }
          },
          "รายวิชา": {
            "300": [
              {
                "รหัสวิชา": "204325",
                "หน่วยกิต": 3
              },
              {
                "รหัสวิชา": "204333",
                "หน่วยกิต": 3
              }
            ],
            "400": [
              {
                "รหัสวิชา": "204422",
                "หน่วยกิต": 3
              },
              {
                "รหัสวิชา": "204423",
                "หน่วยกิต": 3
              }
            ]
          }
        }
        
      },
      "วิชาโท": {
          "หน่วยกิต": 15
        }
    },
    "เสรี": {
      "หน่วยกิต": 6
    }
  }
};

id_find_position_course = ''

deep_test = data['หมวด']['วิชาศึกษาทั่วไป']['GE_Elective']['กลุ่มวิชาด้านการพัฒนาทักษะการเป็นผู้ร่วมสร้างสรรค์นวัตกรรม']
deep_test_seri = data['หมวด']

// recursive หา รหัส
// console.log('CHECK!!!!!!!!')
function find_code(data, code, line_root){
  // ถ้ามี ['รหัสวิชา'] อยู่ใน obj ให้เช็ค
  // console.log('data_001 ==> ', data)
  

  if (typeof(data[0]) == 'object'){
    // console.log('0000000000000000000000')
    if (data[0]['รหัสวิชา']){
      // console.log('111111111111111111')
      // console.log('2222222222222222222', data, code)
      if (find_if_in(data, code, line_root)){
        // console.log('ininininininininiininininininininiinininininininini', line_root)
        
        return 
      }
    }

  }

  
  for (const obj in data){
    // เจอ obj ให้หาลึกๆไปต่อ
    // console.log('CHECK!!!!!!!!', head[obj])
    if (typeof(data[obj]) == 'object'){
      // console.log('----loop')
      // console.log('CHECK!!!!!!!11111!', head[obj])
      find_code(data[obj], code, line_root + [obj] + ' ')
    }
  }


  
}

function find_if_in(course, code, line_root){
  // console.log(course)
  const coursesInGroup = course.map(c => c["รหัสวิชา"]);
  
  if (coursesInGroup.includes(code)) {
    id_find_position_course = line_root
    console.log('หารหัสเจอละหารหัสเจอละหารหัสเจอละหารหัสเจอละหารหัสเจอละหารหัสเจอละหารหัสเจอละหารหัสเจอละ', line_root)
    return true
    
  }else{
    console.log('หาไม่เจอ')
    
  }
}


// console.log('START')

// console.log('Test_find ==>', find_code(data, "001102", ''))
console.log('id_find_position_course ==> {{{', id_find_position_course , '}}}')
// console.log('Test_find 00==>', deep_test[0]['รหัสวิชา'])
// console.log('Test_find 00==>', find_if_in(deep_test, '001101'))
// console.log('Upppppp!!!')
// console.log('Upppppp!!!111, ',data[2])


// console.log('test_null =', data['หมวด'][0]) //undefined
// // console.log('deep_test =', find_if_in(deep_test, "013110") )
// console.log('deep_test =', typeof(deep_test) )
// console.log('deep_test =', deep_test[1]['รหัสวิชา'] )

// console.log('------------------')
// console.log(typeof(deep_test_seri[0]) == 'object')
// console.log(Object.keys(deep_test_seri).length)

// console.log(Object.keys(data).length);
// console.log(data['หมวด']);
// console.log(typeof(data) == 'object')
// console.log(typeof(data) == 'object')

// for (const course_1 in data['หมวด']){
//   console.log('course_1 =', course_1);
//   console.log(course_1 == 'วิชาศึกษาทั่วไป');
  
// }



//------------------------------------------------------

// รหัสวิชาที่ต้องการค้นหา
const targetCourse = "001101";

// ค้นหาว่ารหัสวิชาอยู่ในกลุ่มใด
let foundGroup = null;

for (const groupName in data["วิชาบังคับ"]) {
  console.log(groupName)
  
  const group = data["วิชาบังคับ"][groupName];
  if(typeof(group) == typeof(1)){
    continue;
  }
  
  console.log("Type of data =", typeof(group));
  

  const coursesInGroup = group.map(course => course["รหัสวิชา"]);

  if (coursesInGroup.includes(targetCourse)) {
    foundGroup = groupName;
    break;
  }
}

if (foundGroup) {
  console.log(`วิชา ${targetCourse} อยู่ในกลุ่ม ${foundGroup}`);
} else {
  console.log(`ไม่พบวิชา ${targetCourse} ในกลุ่มใด`);
}



